"""
运算符：
    算数运算符
        +    加          1+1=2
        -    减          1-1=0
        *    乘          2*2=4
        /    除          8/2=4
        //   整除        9//4=2
        %    取余        9%4=1
        **   指数(次方)  2**4=16即2*2*2*2
        ()   小括号      提高运算优先级，即(1+2)*3=9

        优先级：
            ()  大于  **  大于  *,/,//  大于 +,-


    赋值运算符
        =    赋值        将右边的结果赋值给左边的变量
            单变量赋值：    a = 1
            多变量多赋值：  num1, float1, str1 = 1, 1.1, 'hello world'
            多变量赋相同值：x = y = z = 1

        复合赋值运算符
            +=   加赋         c += a  就是 c = c + a
            -=   减赋         c -= a  就是 c = c - a
            *=   乘赋         c *= a  就是 c = c * a
            /=   除赋         c /= a  就是 c = c / a
            //=  整取赋       c //= a 就是 c = c // a
            %=   取余赋       c %= a  就是 c = c % a
            **=  幂赋         c **= a 就是 c = c ** a
                顺序：
                a = 10
                a *= 1+2
                那么是先算1+2再算a*3
                等于30


    比较运算符
        ==  是否相等          a = b = 1则(a==b)为Ture
        !=  是否不相等        a = 2,b = 1则(a!=b)为Ture
        >   是否大于          a = 7,b = 1则(a>b)为Ture
        <   是否小于          a = 1,b = 7则(a<b)为Ture
        >=  是否大于或等于     a = 7,b = 1或a = 1,b = 1则(a>=b)为Ture
        <=  是否小于或等于     a = 1,b = 7或a = 7,b = 7则(a<=b)为Ture

    逻辑运算符
        and 与                都真才真，只要有一个是0，结果就是0
        or  或                有真就真，全假才假。只要有一个不是0，结果就是第一个非0数，全是0才为0
        not 非                取反
"""
