# break    当条件成立时，退出整个循环
# continue 当条件成立时，跳出这次循环接着下次


"""======================================
                    break
======================================"""
print('===========break=============')

i = 1

while i <= 5:  # 本来要吃5个的
    if i == 4:  # 吃到第4个就不吃了
        print('啊，吃饱了，不吃了')
        break  # 结束循环
    print(f'我吃了第{i}个苹果')
    i += 1
"""=====================================
                    continue
====================================="""
print('===========continue===========')

i1 = 1
while i1 <= 5:
    if i1 == 3:
        print(f'我在次第{i1}个，有虫子啊！')
        i1 += 1
        continue
    print(f'吃了第{i1}个')
    i1 += 1
