"""
循环可以配合else使用
else下方代码指的是当循环正常执行结束后执行的代码
"""
i = 1

while i <= 5:
    print(i)
    i += 1
else:
    print('正常执行结束！')

# =================================遇到break不算正常执行============================================
print()

i_2 = 1

while i_2 <= 5:
    if i_2 == 3:
        print('遇到3退出循环！')
        i_2 += 1
        break
    print(i_2)
    i_2 += 1
else:
    print('正常执行结束！')  # 不会执行

# =====================================遇到continue也算正常执行============================================
i_3 = 1

while i_3 <= 5:
    if i_3 == 3:
        print('遇到3跳过')
        i_3 += 1
        continue
    print(i_3)
    i_3 += 1
else:
    print('正常执行结束！')
