"""
"""
"""
capitalize():将字符串第一个字符转换成大写
title()     :将字符串中每个单词首字符转换成大写
upper()     :将字符串中小写转大写
lower()     :将字符串中大写转小写
"""

"""
lstrip()：删除字符串左侧空白字符
rstrip()：删除字符串右侧空白字符
strip() ：删除字符串两侧空白字符
"""
# ======================================================================
"""
ljust()
返回一个原字符串左对齐，并使用指定字符（默认空格）填充至对应长度的新字符串
语法：
    字符串序列.ljust(长度,填充字符)
    
rjust()
返回一个原字符串右对齐，并使用指定字符（默认空格）填充至对应长度的新字符串
语法：
    字符串序列.rjust(长度,填充字符)
    
center()
返回一个原字符串居中对齐，并使用指定字符（默认空格）填充至对应长度的新字符串
语法：
    字符串序列.center(长度,填充字符)
"""
# ========================================================================
"""
startswith()
检查字符串是否以指定子串开头，是返回Ture，不是返回False
如果设置开头结尾下标则只在指定范围内检查
语法：
    字符串序列.startswith(子串,开头下标,结尾下标)
"""
# ========================================================================
"""
isalpha() ：如果字符串至少有一个字符且都是字母返回Ture否则返回False
isdigit() ：如果字符串只包含数字返回Ture否则返回False
isalnum() ：如果至少有一个字符而且都是数字或字母返回Ture否则返回False
isspace() ：如果只包含空格返回Ture否则返回False
"""