"""
集合跟之前的格式都差不多,但有去重功能
不过创建空集合只能用set()
"""

s1 = {1, 1, 2, 3, 4, 3, 5, 6, 7, 8, 9, 0}  # 集合自带去重
print(s1)
s2 = set('abcdefg')
print(s2)
s3 = set()
print(s3)
print(type(s3))
s4 = {}
print(type(s4))

# ========================增加数据=======================
# add 单个
s_1 = {1, 2, 3}
s_1.add(100)
s_1.add(2)
print(s_1)

# update 增加序列
s_1.update([10, 20, 30, 40])

# ===========================删除=========================
# remove 删除指定数据，不存在就报错
s_2 = {1, 2, 3, 4}
s_2.remove(2)
print(s_2)

# discard 删除指定数据，不存在不报错
s_2.discard(2)

# pop 删除某个数据并返回这个数据
del_num = s_2.pop()
print(del_num)
print(s_2)

# =============================查找=======================
ss = {1, 2, 3, 4, 5, 6, 7, 8, 9, 0}
# 1.in 判断数据在序列里？
print(10 in ss)
